<script>
    import Button from "./ui/Button.svelte";
</script>

<div class="hero">
    <div class="hero__title">
        <div class="hero-title__h1">
            <h1>Продажа </h1>
            <h1>квартиры</h1>
        </div>

        <p class="hero-title__description">В Перми и Краснокамске</p>
    </div>

    <div class="hero__btn-container">
        <Button/>
    </div>
</div>

<main>
    <section class="advantages">
        <div class="caret-wrapper">
            <img src="/static/sale-flat/advantages-icon.png" alt="Преимущества иконка">
        </div>
        <div class="advantages-grid">
            <ul class="advantages-grid__title">
                <li></li>
                <li></li>
                <li></li>
            </ul>
            <p></p>
            <p></p>
            <p></p>
            <img src="/static/sale-flat/advantages.png" alt="Преимущества">
        </div>
    </section>

    <section class="guarantees">
        <div class="guarantees-grid">
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <div class="guarantees-folder">
                <h3>надежность</h3>
                <p>12 лет работаем на рынке недвижимости Перми и Пермского края и успешно помогли продать десятки 1-, 2-
                    и 3-х комнатных квартир своим клиентам</p>
            </div>
            <Button/>
        </div>
    </section>
    <section class="stages">
        <div class="stages-grid">
            <h2>этапы работы</h2>
            <div class="stages-elem">
                <h3>Первичная консультация и оценка стоимости</h3>
                <p>Оценим вашу квартиру согласно ее рыночной стоимости, согласуем все условия и подпишем договор о
                    сотрудничестве.</p>
            </div>
            <div class="stages-elem">
                <h3>Первичная консультация и оценка стоимости</h3>
                <p>Оценим вашу квартиру согласно ее рыночной стоимости, согласуем все условия и подпишем договор о
                    сотрудничестве.</p>
            </div>
            <div class="stages-elem">
                <h3>Первичная консультация и оценка стоимости</h3>
                <p>Оценим вашу квартиру согласно ее рыночной стоимости, согласуем все условия и подпишем договор о
                    сотрудничестве.</p>
            </div>
            <div class="stages-elem">
                <h3>Первичная консультация и оценка стоимости</h3>
                <p>Оценим вашу квартиру согласно ее рыночной стоимости, согласуем все условия и подпишем договор о
                    сотрудничестве.</p>
            </div>
            <div class="stages-elem">
                <h3>Первичная консультация и оценка стоимости</h3>
                <p>Оценим вашу квартиру согласно ее рыночной стоимости, согласуем все условия и подпишем договор о
                    сотрудничестве.</p>
            </div>
            <div class="stages-elem">
                <h3>Первичная консультация и оценка стоимости</h3>
                <p>Оценим вашу квартиру согласно ее рыночной стоимости, согласуем все условия и подпишем договор о
                    сотрудничестве.</p>
            </div>
            <div class="caret-wrapper">Этапы продажи квартиры с помощью нашего агентства</div>
        </div>
    </section>

    <section class="risks">
        <div class="risks-info-wrap">
            <h2></h2>
            <p></p>
            <div class="caret-wrap-line">
                <p>
                    Когда же появляются первые сложности, мы по привычке идем за советом и помощью к друзьям и
                    родственникам, не задумываясь о том, что их опыт может быть неприменим в нашей ситуации.
                </p>
                <p>
                    С какими рисками и трудностями может столкнуться при продаже своей квартиры на вторичном рынке
                    неопытный продавец, и чем ему может помочь наше агентство недвижимости?
                </p>
            </div>
        </div>
        <div class="risks-pros-flex">
            <div class="risks-pros-list">
                <h3></h3>
                <ul class="risks-pros-list">
                    <li class="risks-pros-list__elem">
                        <div class="risks-pros-list-title">
                            <h4>01</h4>
                            <div class="caret-wrap">-</div>
                        </div>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                    <li class="risks-pros-list__elem">
                        <h4>01</h4>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                    <li class="risks-pros-list__elem">
                        <h4>01</h4>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                    <li class="risks-pros-list__elem">
                        <h4>01</h4>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                </ul>

                <ul class="risks-pros-list">
                    <li class="risks-pros-list__elem">
                        <div class="risks-pros-list-title">
                            <h4>01</h4>
                            <div class="caret-wrap">-</div>
                        </div>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                    <li class="risks-pros-list__elem">
                        <h4>01</h4>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                    <li class="risks-pros-list__elem">
                        <h4>01</h4>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                    <li class="risks-pros-list__elem">
                        <h4>01</h4>
                        <p>
                            Сложно рассчитать точную стоимость своей квартиры. Можно сильно продешевить или, наоборот,
                            выставить слишком высокую цену и надолго увязнуть в ожидании покупателя.
                        </p>
                    </li>
                </ul>
            </div>
        </div>
    </section>
    <section class="professional">
        <div class="professional-grid">
            <div class="professional-title">
                <h2>обратись к профессионалу за расчетом</h2>
                <p><span>стоимости</span> Один из главных факторов, влияющих на скорость продажи пермских квартир -
                    адекватная цена, соответствующая спросу и предложению на рынке. Самостоятельный расчет стоимости
                </p>
            </div>
            <div class="professional-grid__img">
                <img src="/static/sale-flat/professional.png" alt="Обратись к профессионалу изображение">
            </div>
            <div class="professional-grid_text">может затянуться надолго, ведь никому не хочется терять деньги, занижая
                стоимость своего жилья, или терять потенциальных клиентов, сильно завышая ее. Особенно актуально это для
                продавцов, основная задача которых - продать квартиру быстро.
            </div>
            <div class="professional-grid_text">Мы ежедневно изучаем спрос и предложение на рынке первичной и вторичной
                недвижимости Перми и Пермского края, поэтому можем дать точную оценку и предложить наилучший вариант,
                который поможет выделить плюсы, нивелировать минусы и обойти конкурентов.
            </div>
            <div class="professional-grid_text">Цена квартиры зависит не только от ее состояния, но и от множества
                других факторов, например, района, в котором она расположена. Одно дело - продать квартиру в Центральном
                районе Перми и совсем другое - продать квартиру в Краснокамске на окраине города.
            </div>
            <div class="professional-grid_text">Быстро и объективно учесть все, даже самые незначительные, факторы,
                влияющие на стоимость квартиры, под силу только профессионалу, который занимается этим ежедневно.
                Поэтому, даже если вы решили продавать свою квартиру самостоятельно, лучшее, с чего можно начать этот
                процесс - обратиться к профессиональному оценщику.
            </div>
            <div class="professional-grid_text">Также немаловажное значение имеет количество комнат: если на
                однокомнатные квартиры есть спрос фактически при любой ситуации на рынке, то продать двухкомнатную или
                трехкомнатную квартиру может быть намного сложнее.
            </div>
            <Button/>
        </div>
    </section>

    <section class="order">
        <div class="order-grid">
            <div class="order-form">
                <input/>
                <input/>
                <input/>
                <Button/>
            </div>
            <div class="order-text-1"></div>
            <div class="order-text-2"></div>
        </div>
    </section>

    <section class="articles">
        <h2>полезные статьи</h2>
        <div class="articles-list">
            <div class="article-list__elem">
                <img src="/static/sale-flat/articles/article-1.png" alt="Статья 1">
                <h5></h5>
                <img src="/static/sale-flat/articles/article-2.png" alt="Статья 2">
                <h5></h5>
                <img src="/static/sale-flat/articles/article-3.png" alt="Статья 3">
                <h5></h5>
                <img src="/static/sale-flat/articles/article-4.png" alt="Статья 4">
                <h5></h5>
                <img src="/static/sale-flat/articles/article-5.png" alt="Статья 5">
                <h5></h5>
            </div>
        </div>
    </section>

    <section class="has-questions">
        <div class="has-questions-title">
            <h2>остались вопросы?</h2>
            <div class="has-questions-info">
                <p>Напишите нам, и мы ответим на все ваши вопросы о продаже квартиры в Перми, Закамске и
                    Краснокамске</p>
                <span>Мы на связи с понедельника по пятницу, с 10:00 до 17:00.</span>
            </div>
        </div>

        <div class="has-questions-form">
            <div class="has-questions-form__grid">
                <input/>
                <input/>
                <input/>
                <input/>
                <Button/>
                <div class="has-question-form__give-consent">
                    <input/>
                    <p>Нажимая на кнопку, я даю свое согласие на обработку персональных данных.</p>
                </div>
            </div>
        </div>
    </section>
</main>

<style>

</style>
